In [2]:
from hossam import load_data
from pandas import DataFrame
from pandas import merge

In [4]:
고객 = load_data("customer_no_name")
고객

[data] https://data.hossam.kr/data/lab04/customer-no-name.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 고객 이름에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [7]:
매출 = load_data("customer_no_pay")
매출

[data] https://data.hossam.kr/data/lab04/customer-no-pay.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 매출액에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [10]:
merge(고객, 매출)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [12]:
merge(고객, 매출, how="left")

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [14]:
merge(고객, 매출, how="right")

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [16]:
cd1 = load_data("customer_data1")
cd1

[data] https://data.hossam.kr/data/lab04/customer_data1.xlsx
[desc] 데이터 병합용 실습 데이터 (1) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명         날짜     데이터
0  민수 2018-01-01   20000
1  수영 2018-01-01  100000

In [20]:
cd2 = load_data("customer_data2")
cd2

[data] https://data.hossam.kr/data/lab04/customer_data2.xlsx
[desc] 데이터 병합용 실습 데이터 (2) (인덱스/메타데이터 없음)
[!] Cannot read metadata

  고객명  데이터
0  민수  21세
1  수영  20세

In [22]:
tmp = merge(cd1, cd2, on='고객명')
tmp

  고객명         날짜   데이터_x 데이터_y
0  민수 2018-01-01   20000   21세
1  수영 2018-01-01  100000   20세

In [24]:
df_left = DataFrame({'이름': ['영희', '철수'], '국어':[87,91]})
df_left

   이름  국어
0  영희  87
1  철수  91

In [26]:
df_right = DataFrame({'성명': ['영희', '철수'], '영어': [90,82]})
df_right

   성명  영어
0  영희  90
1  철수  82

In [28]:
r3 = merge(df_left, df_right, left_on=['이름'], right_on = ['성명'])
r3

   이름  국어  성명  영어
0  영희  87  영희  90
1  철수  91  철수  82

In [30]:
df_left = DataFrame({'수학' : [90,82]}, index = ['민철', '봉구'])
df_left

    수학
민철  90
봉구  82

In [34]:
df_right = DataFrame({'국어' : [90,82]}, index=['민철', '철수'])
df_right

    국어
민철  90
철수  82

In [36]:
merge(df_left, df_right, left_index=True, right_index=True)

    수학  국어
민철  90  90

In [38]:
merge(df_left, df_right, left_index=True, right_index=True,
      how="left")

    수학    국어
민철  90  90.0
봉구  82   NaN

In [40]:
merge(df_left, df_right, left_index=True, right_index=True,
      how="right")

      수학  국어
민철  90.0  90
철수   NaN  82

In [42]:
merge(df_left, df_right, left_index=True, right_index=True,
      how="outer")

      수학    국어
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

In [44]:
df_left = DataFrame({'수학': [90,82]}, index=['민철', '봉구'])
df_left

    수학
민철  90
봉구  82

In [46]:
df_right = DataFrame({'성명': ['민철', '철수'], '영어':[90,82]})
df_right

   성명  영어
0  민철  90
1  철수  82

In [48]:
merge(df_left, df_right, left_index=True, right_on=['성명'])

   수학  성명  영어
0  90  민철  90

In [50]:
merge(df_left, df_right, left_index=True, right_on=['성명'],
      how='left')

     수학  성명    영어
0.0  90  민철  90.0
NaN  82  봉구   NaN

In [52]:
merge(df_left, df_right, left_index=True, right_on=['성명'],
      how='right')

     수학  성명  영어
0  90.0  민철  90
1   NaN  철수  82

In [54]:
tmp = merge(df_left, df_right, left_index=True, right_on=['성명'],
            how='outer')
tmp

       수학  성명    영어
0.0  90.0  민철  90.0
NaN  82.0  봉구   NaN
1.0   NaN  철수  82.0

In [55]:
tmp2 = tmp.set_index('성명')
tmp2

      수학    영어
성명
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0